brew "bfg"
brew "eza"
brew "fastfetch"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git-filter-repo"
brew "go"
brew "graphviz"
brew "helm"
brew "htop"
brew "hugo"
brew "iperf3"
brew "jq"
brew "k3d"
brew "k9s"
brew "kind"
brew "python@3.13"
brew "mac-cleanup-py"
brew "mintoolkit"
brew "mole"
brew "newt"
brew "nmap"
brew "ollama"
brew "optipng"
brew "pipx"
brew "poetry"
brew "redis", restart_service: :changed
brew "ruff"
brew "starship"
brew "terraform"
brew "uv"
brew "wget"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "brave-browser"
cask "claude-code"
cask "codex"
cask "docker-desktop"
cask "elgato-stream-deck"
cask "font-fira-code-nerd-font"
cask "ghostty@tip"
cask "google-chrome"
cask "ngrok"
cask "obs"
cask "slack"
cask "visual-studio-code"
cask "webex"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alexcvzz.vscode-sqlite"
vscode "anthropic.claude-code"
vscode "be5invis.toml"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.python-extension-pack"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "hashicorp.terraform"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "raynigon.nginx-formatter"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
vscode "zhuangtongfa.material-theme"
